tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_ENETC.h
#define NETC_ENETC_ECAPR0_RFS_MASK               (0x4U)
#define NETC_ENETC_ECAPR0_RFS_SHIFT              (2U)
#define NETC_ENETC_ECAPR0_RFS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR0_RFS_SHIFT)) & NETC_ENETC_ECAPR0_RFS_MASK)

#define NETC_ENETC_ECAPR0_TSD_MASK               (0x20U)
#define NETC_ENETC_ECAPR0_TSD_SHIFT              (5U)
#define NETC_ENETC_ECAPR0_TSD(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR0_TSD_SHIFT)) & NETC_ENETC_ECAPR0_TSD_MASK)

#define NETC_ENETC_ECAPR0_RSS_MASK               (0x100U)
#define NETC_ENETC_ECAPR0_RSS_SHIFT              (8U)
#define NETC_ENETC_ECAPR0_RSS(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR0_RSS_SHIFT)) & NETC_ENETC_ECAPR0_RSS_MASK)

#define NETC_ENETC_ECAPR0_WO_MASK                (0x2000U)
#define NETC_ENETC_ECAPR0_WO_SHIFT               (13U)
#define NETC_ENETC_ECAPR0_WO(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR0_WO_SHIFT)) & NETC_ENETC_ECAPR0_WO_MASK)

#define NETC_ENETC_ECAPR0_FS_MASK                (0x10000U)
#define NETC_ENETC_ECAPR0_FS_SHIFT               (16U)
/*! FS - Functional safety capability supported. */
#define NETC_ENETC_ECAPR0_FS(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR0_FS_SHIFT)) & NETC_ENETC_ECAPR0_FS_MASK)
/*! @} */

/*! @name ECAPR1 - ENETC capability register 1 */
/*! @{ */

#define NETC_ENETC_ECAPR1_NUM_TCS_MASK           (0x70U)
#define NETC_ENETC_ECAPR1_NUM_TCS_SHIFT          (4U)
#define NETC_ENETC_ECAPR1_NUM_TCS(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR1_NUM_TCS_SHIFT)) & NETC_ENETC_ECAPR1_NUM_TCS_MASK)

#define NETC_ENETC_ECAPR1_NUM_MCH_MASK           (0x300U)
#define NETC_ENETC_ECAPR1_NUM_MCH_SHIFT          (8U)
#define NETC_ENETC_ECAPR1_NUM_MCH(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR1_NUM_MCH_SHIFT)) & NETC_ENETC_ECAPR1_NUM_MCH_MASK)

#define NETC_ENETC_ECAPR1_NUM_UCH_MASK           (0xC00U)
#define NETC_ENETC_ECAPR1_NUM_UCH_SHIFT          (10U)
#define NETC_ENETC_ECAPR1_NUM_UCH(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR1_NUM_UCH_SHIFT)) & NETC_ENETC_ECAPR1_NUM_UCH_MASK)

#define NETC_ENETC_ECAPR1_NUM_MSIX_MASK          (0x7FF000U)
#define NETC_ENETC_ECAPR1_NUM_MSIX_SHIFT         (12U)
/*! NUM_MSIX - Number of MSI-X */
#define NETC_ENETC_ECAPR1_NUM_MSIX(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR1_NUM_MSIX_SHIFT)) & NETC_ENETC_ECAPR1_NUM_MSIX_MASK)

#define NETC_ENETC_ECAPR1_NUM_VSI_MASK           (0xF000000U)
#define NETC_ENETC_ECAPR1_NUM_VSI_SHIFT          (24U)
#define NETC_ENETC_ECAPR1_NUM_VSI(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR1_NUM_VSI_SHIFT)) & NETC_ENETC_ECAPR1_NUM_VSI_MASK)

#define NETC_ENETC_ECAPR1_NUM_IPV_MASK           (0x80000000U)
#define NETC_ENETC_ECAPR1_NUM_IPV_SHIFT          (31U)
#define NETC_ENETC_ECAPR1_NUM_IPV(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR1_NUM_IPV_SHIFT)) & NETC_ENETC_ECAPR1_NUM_IPV_MASK)
/*! @} */

/*! @name ECAPR2 - ENETC capability register 2 */
/*! @{ */

#define NETC_ENETC_ECAPR2_NUM_TX_BDR_MASK        (0x3FFU)
#define NETC_ENETC_ECAPR2_NUM_TX_BDR_SHIFT       (0U)
#define NETC_ENETC_ECAPR2_NUM_TX_BDR(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR2_NUM_TX_BDR_SHIFT)) & NETC_ENETC_ECAPR2_NUM_TX_BDR_MASK)

#define NETC_ENETC_ECAPR2_NUM_RX_BDR_MASK        (0x3FF0000U)
#define NETC_ENETC_ECAPR2_NUM_RX_BDR_SHIFT       (16U)
#define NETC_ENETC_ECAPR2_NUM_RX_BDR(x)          (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_ECAPR2_NUM_RX_BDR_SHIFT)) & NETC_ENETC_ECAPR2_NUM_RX_BDR_MASK)
/*! @} */

/*! @name PMR - Port mode register */
/*! @{ */

#define NETC_ENETC_PMR_SI0EN_MASK                (0x10000U)
#define NETC_ENETC_PMR_SI0EN_SHIFT               (16U)
/*! SI0EN
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PMR_SI0EN(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PMR_SI0EN_SHIFT)) & NETC_ENETC_PMR_SI0EN_MASK)

#define NETC_ENETC_PMR_SI1EN_MASK                (0x20000U)
#define NETC_ENETC_PMR_SI1EN_SHIFT               (17U)
/*! SI1EN
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PMR_SI1EN(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PMR_SI1EN_SHIFT)) & NETC_ENETC_PMR_SI1EN_MASK)
/*! @} */

/*! @name PONVLANR - Port outer native VLAN register */
/*! @{ */

#define NETC_ENETC_PONVLANR_VID_MASK             (0xFFFU)
#define NETC_ENETC_PONVLANR_VID_SHIFT            (0U)
#define NETC_ENETC_PONVLANR_VID(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PONVLANR_VID_SHIFT)) & NETC_ENETC_PONVLANR_VID_MASK)

#define NETC_ENETC_PONVLANR_DEI_MASK             (0x1000U)
#define NETC_ENETC_PONVLANR_DEI_SHIFT            (12U)
#define NETC_ENETC_PONVLANR_DEI(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PONVLANR_DEI_SHIFT)) & NETC_ENETC_PONVLANR_DEI_MASK)

#define NETC_ENETC_PONVLANR_PCP_MASK             (0xE000U)
#define NETC_ENETC_PONVLANR_PCP_SHIFT            (13U)
#define NETC_ENETC_PONVLANR_PCP(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PONVLANR_PCP_SHIFT)) & NETC_ENETC_PONVLANR_PCP_MASK)

#define NETC_ENETC_PONVLANR_TPID_MASK            (0x30000U)
#define NETC_ENETC_PONVLANR_TPID_SHIFT           (16U)
/*! TPID
 *  0b00..Standard C-VLAN 0x8100
 *  0b01..Standard S-VLAN 0x88A8
 *  0b10..Custom VLAN as defined by CVLANR1[ETYPE]
 *  0b11..Custom VLAN as defined by CVLANR2[ETYPE]
 */
#define NETC_ENETC_PONVLANR_TPID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PONVLANR_TPID_SHIFT)) & NETC_ENETC_PONVLANR_TPID_MASK)

#define NETC_ENETC_PONVLANR_PNE_MASK             (0x40000U)
#define NETC_ENETC_PONVLANR_PNE_SHIFT            (18U)
/*! PNE - Port Native VLAN Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PONVLANR_PNE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PONVLANR_PNE_SHIFT)) & NETC_ENETC_PONVLANR_PNE_MASK)

#define NETC_ENETC_PONVLANR_VZE_MASK             (0x80000U)
#define NETC_ENETC_PONVLANR_VZE_SHIFT            (19U)
/*! VZE - VID 0 Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PONVLANR_VZE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PONVLANR_VZE_SHIFT)) & NETC_ENETC_PONVLANR_VZE_MASK)
/*! @} */

/*! @name PINVLANR - Port inner native VLAN register */
/*! @{ */

#define NETC_ENETC_PINVLANR_VID_MASK             (0xFFFU)
#define NETC_ENETC_PINVLANR_VID_SHIFT            (0U)
#define NETC_ENETC_PINVLANR_VID(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PINVLANR_VID_SHIFT)) & NETC_ENETC_PINVLANR_VID_MASK)

#define NETC_ENETC_PINVLANR_DEI_MASK             (0x1000U)
#define NETC_ENETC_PINVLANR_DEI_SHIFT            (12U)
#define NETC_ENETC_PINVLANR_DEI(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PINVLANR_DEI_SHIFT)) & NETC_ENETC_PINVLANR_DEI_MASK)

