tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_ENETC.h
#define NETC_ENETC_IPV2ICMPMR0_IPV6ICM_MASK      (0x1000000U)
#define NETC_ENETC_IPV2ICMPMR0_IPV6ICM_SHIFT     (24U)
#define NETC_ENETC_IPV2ICMPMR0_IPV6ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV6ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV6ICM_MASK)

#define NETC_ENETC_IPV2ICMPMR0_IPV7ICM_MASK      (0x10000000U)
#define NETC_ENETC_IPV2ICMPMR0_IPV7ICM_SHIFT     (28U)
#define NETC_ENETC_IPV2ICMPMR0_IPV7ICM(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_IPV2ICMPMR0_IPV7ICM_SHIFT)) & NETC_ENETC_IPV2ICMPMR0_IPV7ICM_MASK)
/*! @} */

/*! @name PRIO2TCMR0 - Transmit priority to traffic class mapping register 0 */
/*! @{ */

#define NETC_ENETC_PRIO2TCMR0_PRIO0TC_MASK       (0x7U)
#define NETC_ENETC_PRIO2TCMR0_PRIO0TC_SHIFT      (0U)
#define NETC_ENETC_PRIO2TCMR0_PRIO0TC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRIO2TCMR0_PRIO0TC_SHIFT)) & NETC_ENETC_PRIO2TCMR0_PRIO0TC_MASK)

#define NETC_ENETC_PRIO2TCMR0_PRIO1TC_MASK       (0x70U)
#define NETC_ENETC_PRIO2TCMR0_PRIO1TC_SHIFT      (4U)
#define NETC_ENETC_PRIO2TCMR0_PRIO1TC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRIO2TCMR0_PRIO1TC_SHIFT)) & NETC_ENETC_PRIO2TCMR0_PRIO1TC_MASK)

#define NETC_ENETC_PRIO2TCMR0_PRIO2TC_MASK       (0x700U)
#define NETC_ENETC_PRIO2TCMR0_PRIO2TC_SHIFT      (8U)
#define NETC_ENETC_PRIO2TCMR0_PRIO2TC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRIO2TCMR0_PRIO2TC_SHIFT)) & NETC_ENETC_PRIO2TCMR0_PRIO2TC_MASK)

#define NETC_ENETC_PRIO2TCMR0_PRIO3TC_MASK       (0x7000U)
#define NETC_ENETC_PRIO2TCMR0_PRIO3TC_SHIFT      (12U)
#define NETC_ENETC_PRIO2TCMR0_PRIO3TC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRIO2TCMR0_PRIO3TC_SHIFT)) & NETC_ENETC_PRIO2TCMR0_PRIO3TC_MASK)

#define NETC_ENETC_PRIO2TCMR0_PRIO4TC_MASK       (0x70000U)
#define NETC_ENETC_PRIO2TCMR0_PRIO4TC_SHIFT      (16U)
#define NETC_ENETC_PRIO2TCMR0_PRIO4TC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRIO2TCMR0_PRIO4TC_SHIFT)) & NETC_ENETC_PRIO2TCMR0_PRIO4TC_MASK)

#define NETC_ENETC_PRIO2TCMR0_PRIO5TC_MASK       (0x700000U)
#define NETC_ENETC_PRIO2TCMR0_PRIO5TC_SHIFT      (20U)
#define NETC_ENETC_PRIO2TCMR0_PRIO5TC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRIO2TCMR0_PRIO5TC_SHIFT)) & NETC_ENETC_PRIO2TCMR0_PRIO5TC_MASK)

#define NETC_ENETC_PRIO2TCMR0_PRIO6TC_MASK       (0x7000000U)
#define NETC_ENETC_PRIO2TCMR0_PRIO6TC_SHIFT      (24U)
#define NETC_ENETC_PRIO2TCMR0_PRIO6TC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRIO2TCMR0_PRIO6TC_SHIFT)) & NETC_ENETC_PRIO2TCMR0_PRIO6TC_MASK)

#define NETC_ENETC_PRIO2TCMR0_PRIO7TC_MASK       (0x70000000U)
#define NETC_ENETC_PRIO2TCMR0_PRIO7TC_SHIFT      (28U)
#define NETC_ENETC_PRIO2TCMR0_PRIO7TC(x)         (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PRIO2TCMR0_PRIO7TC_SHIFT)) & NETC_ENETC_PRIO2TCMR0_PRIO7TC_MASK)
/*! @} */

/*! @name PTCTSDR - Port traffic class 0 time specific departure register..Port traffic class 7 time specific departure register */
/*! @{ */

#define NETC_ENETC_PTCTSDR_TSDE_MASK             (0x80000000U)
#define NETC_ENETC_PTCTSDR_TSDE_SHIFT            (31U)
/*! TSDE
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PTCTSDR_TSDE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PTCTSDR_TSDE_SHIFT)) & NETC_ENETC_PTCTSDR_TSDE_MASK)
/*! @} */

/* The count of NETC_ENETC_PTCTSDR */
#define NETC_ENETC_PTCTSDR_COUNT                 (8U)

/*! @name SMCAPR - Switch management capability register */
/*! @{ */

#define NETC_ENETC_SMCAPR_SM_MASK                (0x1U)
#define NETC_ENETC_SMCAPR_SM_SHIFT               (0U)
/*! SM - Switch Management
 *  0b0..ENETC instance has no switch management capability
 *  0b1..ENETC instance has switch management capability
 */
#define NETC_ENETC_SMCAPR_SM(x)                  (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_SMCAPR_SM_SHIFT)) & NETC_ENETC_SMCAPR_SM_MASK)
/*! @} */

/*! @name SMHRBDRMR - Switch management host reason 1 receive BD ring mapping register..Switch management host reason 15 receive BD ring mapping register */
/*! @{ */

#define NETC_ENETC_SMHRBDRMR_RXBDR_MASK          (0xFFU)
#define NETC_ENETC_SMHRBDRMR_RXBDR_SHIFT         (0U)
#define NETC_ENETC_SMHRBDRMR_RXBDR(x)            (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_SMHRBDRMR_RXBDR_SHIFT)) & NETC_ENETC_SMHRBDRMR_RXBDR_MASK)
/*! @} */

/* The count of NETC_ENETC_SMHRBDRMR */
#define NETC_ENETC_SMHRBDRMR_COUNT               (15U)

/*! @name PSIPMAR0 - Port station interface 0 primary MAC address register 0..Port station interface 1 primary MAC address register 0 */
/*! @{ */

#define NETC_ENETC_PSIPMAR0_PRIM_MAC_ADDR_MASK   (0xFFFFFFFFU)
#define NETC_ENETC_PSIPMAR0_PRIM_MAC_ADDR_SHIFT  (0U)
#define NETC_ENETC_PSIPMAR0_PRIM_MAC_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPMAR0_PRIM_MAC_ADDR_SHIFT)) & NETC_ENETC_PSIPMAR0_PRIM_MAC_ADDR_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIPMAR0 */
#define NETC_ENETC_PSIPMAR0_COUNT                (2U)

/*! @name PSIPMAR1 - Port station interface 0 primary MAC address register 1..Port station interface 1 primary MAC address register 1 */
/*! @{ */

#define NETC_ENETC_PSIPMAR1_PRIM_MAC_ADDR_MASK   (0xFFFFU)
#define NETC_ENETC_PSIPMAR1_PRIM_MAC_ADDR_SHIFT  (0U)
#define NETC_ENETC_PSIPMAR1_PRIM_MAC_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIPMAR1_PRIM_MAC_ADDR_SHIFT)) & NETC_ENETC_PSIPMAR1_PRIM_MAC_ADDR_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIPMAR1 */
#define NETC_ENETC_PSIPMAR1_COUNT                (2U)

/*! @name PSIVLANR - Port station interface 0 VLAN register..Port station interface 1 VLAN register */
/*! @{ */

#define NETC_ENETC_PSIVLANR_VID_MASK             (0xFFFU)
#define NETC_ENETC_PSIVLANR_VID_SHIFT            (0U)
#define NETC_ENETC_PSIVLANR_VID(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVLANR_VID_SHIFT)) & NETC_ENETC_PSIVLANR_VID_MASK)

#define NETC_ENETC_PSIVLANR_DEI_MASK             (0x1000U)
#define NETC_ENETC_PSIVLANR_DEI_SHIFT            (12U)
#define NETC_ENETC_PSIVLANR_DEI(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVLANR_DEI_SHIFT)) & NETC_ENETC_PSIVLANR_DEI_MASK)

#define NETC_ENETC_PSIVLANR_PCP_MASK             (0xE000U)
#define NETC_ENETC_PSIVLANR_PCP_SHIFT            (13U)
#define NETC_ENETC_PSIVLANR_PCP(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVLANR_PCP_SHIFT)) & NETC_ENETC_PSIVLANR_PCP_MASK)

