tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/device/periph/PERI_NETC_ENETC.h
#define NETC_ENETC_PSIVLANR_TPID_MASK            (0x30000U)
#define NETC_ENETC_PSIVLANR_TPID_SHIFT           (16U)
/*! TPID
 *  0b00..Standard C-VLAN 0x8100
 *  0b01..Standard S-VLAN 0x88A8
 *  0b10..Custom VLAN as defined by CVLANR1[ETYPE]. Note that CVLANR1[V] is not checked for SI-based VLAN
 *        insertion; TPID value specified in CVLANR1[ETYPE] will be used to construct the VLAN header regardless of the
 *        value specified in CVLANR1[V].
 *  0b11..Custom VLAN as defined by CVLANR2[ETYPE]. Note that CVLANR2[V] is not checked for SI-based VLAN
 *        insertion; TPID value specified in CVLANR2[ETYPE] will be used to construct the VLAN header regardless of the
 *        value specified in CVLANR2[V].
 */
#define NETC_ENETC_PSIVLANR_TPID(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVLANR_TPID_SHIFT)) & NETC_ENETC_PSIVLANR_TPID_MASK)

#define NETC_ENETC_PSIVLANR_E_MASK               (0x80000000U)
#define NETC_ENETC_PSIVLANR_E_SHIFT              (31U)
/*! E - Enable
 *  0b0..Disabled
 *  0b1..Enabled; SI-based VLAN information is added on transmit and removed on receive.
 */
#define NETC_ENETC_PSIVLANR_E(x)                 (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSIVLANR_E_SHIFT)) & NETC_ENETC_PSIVLANR_E_MASK)
/*! @} */

/* The count of NETC_ENETC_PSIVLANR */
#define NETC_ENETC_PSIVLANR_COUNT                (2U)

/*! @name PSICFGR0 - Port station interface 0 configuration register 0..Port station interface 1 configuration register 0 */
/*! @{ */

#define NETC_ENETC_PSICFGR0_NUM_TX_BDR_MASK      (0x7FU)
#define NETC_ENETC_PSICFGR0_NUM_TX_BDR_SHIFT     (0U)
#define NETC_ENETC_PSICFGR0_NUM_TX_BDR(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_NUM_TX_BDR_SHIFT)) & NETC_ENETC_PSICFGR0_NUM_TX_BDR_MASK)

#define NETC_ENETC_PSICFGR0_SPE_MASK             (0x800U)
#define NETC_ENETC_PSICFGR0_SPE_SHIFT            (11U)
/*! SPE - Source Pruning Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define NETC_ENETC_PSICFGR0_SPE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_SPE_SHIFT)) & NETC_ENETC_PSICFGR0_SPE_MASK)

#define NETC_ENETC_PSICFGR0_VTE_MASK             (0x1000U)
#define NETC_ENETC_PSICFGR0_VTE_SHIFT            (12U)
/*! VTE - VLAN Tag Extract
 *  0b0..SI-based VLAN removal disabled
 *  0b1..SI-based VLAN removal enabled
 */
#define NETC_ENETC_PSICFGR0_VTE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_VTE_SHIFT)) & NETC_ENETC_PSICFGR0_VTE_MASK)

#define NETC_ENETC_PSICFGR0_SIVIE_MASK           (0x4000U)
#define NETC_ENETC_PSICFGR0_SIVIE_SHIFT          (14U)
/*! SIVIE - SI-based VLAN Insertion Enable
 *  0b0..SI-based VLAN insertion disabled
 *  0b1..SI-based VLAN insertion enabled
 */
#define NETC_ENETC_PSICFGR0_SIVIE(x)             (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_SIVIE_SHIFT)) & NETC_ENETC_PSICFGR0_SIVIE_MASK)

#define NETC_ENETC_PSICFGR0_ASE_MASK             (0x8000U)
#define NETC_ENETC_PSICFGR0_ASE_SHIFT            (15U)
/*! ASE - Anti-spoofing enable */
#define NETC_ENETC_PSICFGR0_ASE(x)               (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_ASE_SHIFT)) & NETC_ENETC_PSICFGR0_ASE_MASK)

#define NETC_ENETC_PSICFGR0_NUM_RX_BDR_MASK      (0x7F0000U)
#define NETC_ENETC_PSICFGR0_NUM_RX_BDR_SHIFT     (16U)
#define NETC_ENETC_PSICFGR0_NUM_RX_BDR(x)        (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_NUM_RX_BDR_SHIFT)) & NETC_ENETC_PSICFGR0_NUM_RX_BDR_MASK)

#define NETC_ENETC_PSICFGR0_SIVC_MASK            (0xF000000U)
#define NETC_ENETC_PSICFGR0_SIVC_SHIFT           (24U)
#define NETC_ENETC_PSICFGR0_SIVC(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_SIVC_SHIFT)) & NETC_ENETC_PSICFGR0_SIVC_MASK)

#define NETC_ENETC_PSICFGR0_SIBW_MASK            (0xF0000000U)
#define NETC_ENETC_PSICFGR0_SIBW_SHIFT           (28U)
#define NETC_ENETC_PSICFGR0_SIBW(x)              (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR0_SIBW_SHIFT)) & NETC_ENETC_PSICFGR0_SIBW_MASK)
/*! @} */

/* The count of NETC_ENETC_PSICFGR0 */
#define NETC_ENETC_PSICFGR0_COUNT                (2U)

/*! @name PSICFGR1 - Port station interface 1 configuration register 1 */
/*! @{ */

#define NETC_ENETC_PSICFGR1_TC0_MAP_MASK         (0x7U)
#define NETC_ENETC_PSICFGR1_TC0_MAP_SHIFT        (0U)
#define NETC_ENETC_PSICFGR1_TC0_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC0_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC0_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC1_MAP_MASK         (0x70U)
#define NETC_ENETC_PSICFGR1_TC1_MAP_SHIFT        (4U)
#define NETC_ENETC_PSICFGR1_TC1_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC1_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC1_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC2_MAP_MASK         (0x700U)
#define NETC_ENETC_PSICFGR1_TC2_MAP_SHIFT        (8U)
#define NETC_ENETC_PSICFGR1_TC2_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC2_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC2_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC3_MAP_MASK         (0x7000U)
#define NETC_ENETC_PSICFGR1_TC3_MAP_SHIFT        (12U)
#define NETC_ENETC_PSICFGR1_TC3_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC3_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC3_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC4_MAP_MASK         (0x70000U)
#define NETC_ENETC_PSICFGR1_TC4_MAP_SHIFT        (16U)
#define NETC_ENETC_PSICFGR1_TC4_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC4_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC4_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC5_MAP_MASK         (0x700000U)
#define NETC_ENETC_PSICFGR1_TC5_MAP_SHIFT        (20U)
#define NETC_ENETC_PSICFGR1_TC5_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC5_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC5_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC6_MAP_MASK         (0x7000000U)
#define NETC_ENETC_PSICFGR1_TC6_MAP_SHIFT        (24U)
#define NETC_ENETC_PSICFGR1_TC6_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC6_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC6_MAP_MASK)

#define NETC_ENETC_PSICFGR1_TC7_MAP_MASK         (0x70000000U)
#define NETC_ENETC_PSICFGR1_TC7_MAP_SHIFT        (28U)
#define NETC_ENETC_PSICFGR1_TC7_MAP(x)           (((uint32_t)(((uint32_t)(x)) << NETC_ENETC_PSICFGR1_TC7_MAP_SHIFT)) & NETC_ENETC_PSICFGR1_TC7_MAP_MASK)
/*! @} */

/* The count of NETC_ENETC_PSICFGR1 */
#define NETC_ENETC_PSICFGR1_COUNT                (2U)

/*! @name PSICFGR2 - Port station interface 0 configuration register 2..Port station interface 1 configuration register 2 */
/*! @{ */

